{
  "VERSION": "Version",
  "PRIVACY": "Privacy",
  "PRIVACY_POLICY": {
    "TITLE": "Privacy Policy",
    "INTRO": "Welcome to Virtual Board Game! We take your privacy seriously and are committed to protecting your personal information. This policy outlines in detail what information we collect, how we use it, and the steps we take to keep it secure. Your trust is our priority.",
    "DATA_COLLECTION": {
      "TITLE": "What Information We Collect",
      "CONTENT": "We collect essential data to provide our services, such as your email address, username, game history, and in-app purchases. Additionally, we may gather data about your interactions with our platform, including gameplay statistics, preferences, and user settings. Please note that we do not directly store payment information; all transactions are securely handled by third-party payment providers with robust security protocols."
    },
    "DATA_USAGE": {
      "TITLE": "How We Use Your Data",
      "CONTENT": "The information we collect is used to ensure the smooth functioning of our platform and to deliver a personalized experience. This includes tailoring game content to your preferences, providing prompt technical support, and maintaining a safe environment for all users. We may also analyze usage data (in an anonymized format) to identify technical issues, improve existing features, and develop new functionalities that enhance your gaming experience."
    },
    "DATA_SHARING": {
      "TITLE": "Who We Share Your Data With",
      "CONTENT": "We do not sell your personal data to third parties for marketing purposes. We only share your information with trusted partners who assist us in operating the platform, such as data hosting providers, analytics tools, and payment processors. These partners are bound by strict confidentiality agreements to ensure the secure and responsible use of your data."
    },
    "USER_RIGHTS": {
      "TITLE": "Your Rights",
      "CONTENT": "As a user, you have the right to access, update, or delete your account information at any time. You can manage your data directly through the app’s account settings or by reaching out to our support team. Additionally, you have the right to request details about how we use your data and to object to its use for specific purposes, such as data analysis. We are here to help you exercise these rights with ease."
    },
    "CHANGES": {
      "TITLE": "Policy Updates",
      "CONTENT": "We may update this Privacy Policy occasionally to reflect changes in our services, legal requirements, or security standards. Significant changes will be communicated through notices on our platform or via email. We encourage you to review this policy periodically to stay informed."
    },
    "CONTACT": {
      "TITLE": "Contact Us",
      "CONTENT": "If you have questions, comments, or concerns about our Privacy Policy, our team is ready to assist you. Send us a message through the 'Send Feedback' button in the menu, and we will make sure to respond as soon as possible."
    },
    "COOKIES": {
      "TITLE": "Cookies Usage",
      "CONTENT": "We use cookies to deliver a seamless and personalized user experience. Cookies help us remember your preferences, such as language settings and visual themes, and collect information about your interactions with our app. This data enables us to identify areas for improvement and ensure all users enjoy an optimized service."
    }
  },
  "DOWNLOAD": "Download",
  "INSTALL_DISMISS_TOAST": "If you want to download it later, go to settings",

  "MENU": {
    "LOGOUT": "Log out",
    "REPLAYS": "View replays",
    "PROFILE": "Profile",
    "FRIENDS_LIST": "Friends list",
    "CUSTOMIZE_GAMES": "Customize games",
    "MESSAGES": "Messages",
    "CLOSE": "Close menu",
    "ADD_GAME": "Add game",
    "ADD_PRODUCT": "Add Product",
    "ADD_ACHIEVEMENT": "Add Achievement"
  },

  "LOGIN": {
    "TITLE": "Login",
    "EMAIL": "Email",
    "PASSWORD": "Password",
    "VALID_EMAIL": "Enter a valid email",
    "VALID_PASSWORD": "Enter a valid password",
    "FORGOT_PASSWORD": "Forgot your password?",
    "REMEMBER_ME": "Remember me",
    "LOGIN_BUTTON": "Login",
    "SIGNUP": "Don't have an account?",
    "ERROR": {
      "INVALID_PASSWORD": "The password must be at least 6 characters long.",
      "INVALID_EMAIL": "Enter a valid email address.",
      "INVALID_CREDENTIALS": "Invalid credentials. Please try again.",
      "EMPTY_FIELD": "This field is required."
    }
  },

  "REGISTER": {
    "TITLE": "Sign Up",
    "BUTTON": "Sign Up",
    "EMAIL": "Email",
    "USERNAME": "Username",
    "PASSWORD": "Password",
    "CONFIRM_PASSWORD": "Confirm Password",
    "ADD_PROFILE_IMG": "Add profile image (optional)",
    "PROFILE_IMG_ALT": "Image to be uploaded",
    "HELPER_TEXT": {
      "PASSWORD": "Your password must contain at least one uppercase letter, one lowercase letter, and one number.",
      "EMAIL": "Please enter a valid email",
      "USERNAME": "Choose a unique username. It should be at least 6 characters long.",
      "CONFIRM_PASSWORD": "Please re-enter your password to confirm."
    },
    "ERRORS": {
      "REQUIRED": "This field is required.",
      "INVALID_EMAIL": "Please enter a valid email address.",
      "USERNAME_MIN_LENGTH": "Username must be at least 6 characters long.",
      "PASSWORD_MIN_LENGTH": "Password must be at least 6 characters long.",
      "INVALID_PASSWORD": "Password must contain at least one uppercase letter and one number.",
      "PASSWORD_MISMATCH": "Passwords do not match."
    },
    "TOAST": "Success! The user has been created"
  },

  "FEEDBACK": "Send feedback",
  "FEEDBACK_PAGE": {
    "TITLE": "Help Us Improve",
    "SUBTITLE": "Share your ideas, suggestions, or issues with us",
    "SUBJECT": "Subject",
    "PLACEHOLDER_SUBJECT": "Enter the title of your message",
    "BODY": "Message Body",
    "PLACEHOLDER_BODY": "Describe your message in at least 20 characters",
    "RADIO_BUG": "Bug report",
    "RADIO_SUGGESTION": "Improvement proposal",
    "TOAST": "Thank you for your comment. Your opinion is important to us and helps us improve every day."
  },

  "WELCOMING_MESSAGE": {
    "TITLE": "Welcome to Virtual Board Games! ",
    "BODY": "thank you for registering. We’re glad to have you on board. Connect, challenge your friends, and start playing. Let the fun begin!"
  },

  "MESSAGES_PAGE": {
    "TITLE": "Messages list",
    "SEND_BY": "Sent by:",
    "READ": "Read",
    "NO_READ": "Unread",
    "CLOSE_MESSAGE": "Close",
    "NO_MESSAGES": "You have no messages at the moment.",
    "MESSAGE": {
      "NEXT_MESSAGE": "Next",
      "PREVIOUS_MESSAGE": "Previous",
      "MESSAGE_DETAILS": "Message details",
      "FROM": "From",
      "TO": "To",
      "DATE": "Date",
      "TYPE": "Type",
      "BODY": "Body",
      "TYPES" : {
        "BUG": "Bug",
        "SUGGESTION": "Suggestion",
        "GAME_CHALLENGE": "Game Challenge",
        "FRIEND_REQUEST": "Friend Request",
        "ACHIEVEMENT_UNLOCKED": "Achievement Unlocked",
        "STORE_PROMOTION": "Store Promotion",
        "WARNING": "Warning",
        "SYSTEM_NOTIFICATION": "System Notification"
      }
    }
  },

  "NO_FAVOURITE_ACHIEVEMENT": "None"

}
